### Terraform Plan for Production 🔍

<details>
<summary>Show Plan</summary>

```terraform
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.app.module.ssr_task.aws_ecs_task_definition.task[0] must be replaced
-/+ resource "aws_ecs_task_definition" "task" {
      ~ arn                      = "arn:aws:ecs:eu-west-1:471112960535:task-definition/digitalekanaler-designmanual:145" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:eu-west-1:471112960535:task-definition/digitalekanaler-designmanual" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ image            = "637423315721.dkr.ecr.eu-west-1.amazonaws.com/designmanual:c9487f90b48fe3cfc84f40b3c6fbd133c5620047" -> "637423315721.dkr.ecr.eu-west-1.amazonaws.com/designmanual:c16fb2bc8e1d88ae20ebe1a3304e8bf979bf533c"
                    name             = "digitalekanaler-designmanual-main"
                    # (8 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "digitalekanaler-designmanual" -> (known after apply)
      ~ revision                 = 145 -> (known after apply)
      - tags                     = {} -> null
        # (13 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Warning: Redundant ignore_changes element

  on .terraform/modules/app.preview_url/main.tf line 111, in resource "aws_lambda_function" "lambda_function":
 111: resource "aws_lambda_function" "lambda_function" {

Adding an attribute name to ignore_changes tells Terraform to ignore future
changes to the argument in configuration after the object has been created,
retaining the value originally configured.

The attribute qualified_arn is decided by the provider alone and therefore
there can be no configured value to compare with. Including this attribute in
ignore_changes has no effect. Remove the attribute from ignore_changes to
quiet this warning.

(and 2 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*For commit 34be9a34fad4d6eea55bc70004f702d6ce2f08fb*
*Plan generated at: 2026-02-17 15:57:17 UTC*
